---
kind: property
id: P:Autodesk.Revit.DB.Structure.AreaReinforcement.AdditionalBottomCoverOffset
source: html/dca7d7af-c539-7712-9f12-f2a16fd160d6.htm
---
# Autodesk.Revit.DB.Structure.AreaReinforcement.AdditionalBottomCoverOffset Property

Additional offset from the bottom or interior cover reference.

## Syntax (C#)
```csharp
public double AdditionalBottomCoverOffset { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: The given value for additionalBottomCoverOffset must be no more than 30000 feet in absolute value.